In [4]:
class animal:
    def __init__(self, num):
        self.num = num

    def sum(a, b):
        return a+b

In [6]:
!conda list | findstr pandas

pandas                    0.22.0           py36h6538335_0

In [29]:
import pandas as pd
import numpy as np
url="https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
df=pd.read_csv(url, nrows=10)
df
df.to_csv("sample.csv", mode='w')

In [18]:
df=pd.read_csv("sample.csv")
df

   Unnamed: 0                   Country  Region
0           0                   Algeria  AFRICA
1           1                    Angola  AFRICA
2           2                     Benin  AFRICA
3           3                  Botswana  AFRICA
4           4                   Burkina  AFRICA
5           5                   Burundi  AFRICA
6           6                  Cameroon  AFRICA
7           7                Cape Verde  AFRICA
8           8  Central African Republic  AFRICA
9           9                      Chad  AFRICA

In [21]:
friend_dict_list = [{'name':'Jone','age':20,'job':'student'}
                   ,{'name':'Nate','age':25,'job':'teacher'}
                   ,{'name':'Jenny','age':27,'job':'doctor'}]

## Pandas 실습

In [23]:
df = pd.DataFrame(friend_dict_list)
df

   age      job   name
0   20  student   Jone
1   25  teacher   Nate
2   27   doctor  Jenny

In [24]:
df

   age      job   name
0   20  student   Jone
1   25  teacher   Nate
2   27   doctor  Jenny

In [25]:
df=df[['name','age','job']]

In [26]:
df

    name  age      job
0   Jone   20  student
1   Nate   25  teacher
2  Jenny   27   doctor

In [31]:
df['salary'] = 0
df

                    Country  Region  salary
0                   Algeria  AFRICA       0
1                    Angola  AFRICA       0
2                     Benin  AFRICA       0
3                  Botswana  AFRICA       0
4                   Burkina  AFRICA       0
5                   Burundi  AFRICA       0
6                  Cameroon  AFRICA       0
7                Cape Verde  AFRICA       0
8  Central African Republic  AFRICA       0
9                      Chad  AFRICA       0

In [35]:
A = np.array([[1,2], [3,4]])
print(A)
A.shape
A.dtype
B = np.array([[3,0], [0,6]])
A+B
A*B

[[1 2]
 [3 4]]

array([[ 3,  0],
       [ 0, 24]])

In [37]:
nums = list(range(5))
print(nums)

[0, 1, 2, 3, 4]

In [38]:
print(nums[2:4])

[2, 3]

In [39]:
print(nums[2:])

[2, 3, 4]

In [41]:
print(nums[:2])

[0, 1]

In [43]:
nums[2:4] = [8,9]

In [44]:
print(nums)

[0, 1, 8, 9, 4]